[{
    "id": "d688caf0-70bc-11e8-930c-b4d742286fea",
    "created_at": "Fri Jun 15 16:56:48 UTC 2018",
    "title": "Front-End Developer",
    "location": "Washington, DC",
    "type": "Full Time",
    "description": "<p>New America, an innovative, nonprofit civic enterprise, located steps from the White House in Washington, D.C., is seeking a Front-End Developer with a passion for great design and user experiences to help us build beautiful, engaging interactives and data visualizations that better inform communities and policymakers.</p>\n\n<p>The ideal candidate has a strong appreciation for human-centered design, loves simplifying complex concepts into easily digestible graphics, and shares New America's commitment to confronting the challenges caused by rapid technological change, and seizing the opportunities those changes create. Good organizational skills and the ability to communicate effectively with both technical and non-technical colleagues is a must.</p>\n\n<p>The successful candidate for this position will be working in an organization with some of America’s leading technologists, and which houses original research data on topics as varied as drone technology, financial opportunity, and childcare affordability. We use and contribute to open source libraries and frameworks wherever possible, and we’re looking for a developer who will feel at home in this kind of environment.</p>\n\n<p>Responsibilities:</p>\n\n<p>Work on our design/development team and collaborate with policy analysts to plan, design, build, test, and launch compelling visualizations of data-driven research.\nLead front-end development projects on our digital properties, including our main website, Intranet, and various one-off projects.\nWork closely with New America’s communications, editorial, events, and production teams to ensure that we remain brand-consistent\nQualifications:</p>\n\n<p>Candidates for this position should have the following:</p>\n\n<p>Experience writing well organized, semantic HTML and CSS/SASS with attention to design details.\nExperience writing modular, object-oriented Javascript code and components with an eye towards reusability.\nGood design sensibilities (eye for detail and typography) and the ability to work within established brand style\nComfort navigating Sketch, Adobe Illustrator, or Photoshop.\nFamiliarity with build tools such as Webpack.\nExperience with version control using Git.\nSolid understanding of REST APIs.\nGreat work ethic, approachability, eagerness to work in a collaborative environment.\nBonus skills:</p>\n\n<p>Experience creating interactive data visualizations such as maps and charts.\nExperience with D3.\nFamiliarity with React or other JS libraries like Ember or Vue.\nExperience with at least one client or server-side MVC framework.\n Application Process:</p>\n\n<p>Visit <a href=\"https://www.newamerica.org/jobs/:\">https://www.newamerica.org/jobs/:</a> Submit a cover letter and resume. Candidates are encouraged to share links to portfolios of their work and/or their GitHub repos. Applications are reviewed on a rolling basis, so early submissions are recommended.</p>\n\n<p>Please, no phone calls or emails.</p>\n\n<p> New America is an equal opportunity employer committed to hiring a diverse workforce at all levels of the organization thereby creating a culture that allows us to better serve our clientele, our employees and our communities. We value and encourage the contributions of our employees and strive to create an environment where everyone can reach their full potential and drive outstanding results. All qualified applicants will receive consideration for employment without regard to race, national origin, age, sex, religion, disability, sexual orientation, marital status, veteran status, gender identity or expression, or any other basis protected by local, state, or federal law. This policy applies with regard to all aspects of one’s employment, including hiring, transfer, promotion, compensation, eligibility for benefits, and termination.</p>",
    "how_to_apply": "<p>Visit <a href=\"https://www.newamerica.org/jobs/:\">https://www.newamerica.org/jobs/:</a> Submit a cover letter and resume. Candidates are encouraged to share links to portfolios of their work and/or their GitHub repos. Applications are reviewed on a rolling basis, so early submissions are recommended.</p>\n\n<p>Please, no phone calls or emails.</p>\n\n<p> New America is an equal opportunity employer committed to hiring a diverse workforce at all levels of the organization thereby creating a culture that allows us to better serve our clientele, our employees and our communities. We value and encourage the contributions of our employees and strive to create an environment where everyone can reach their full potential and drive outstanding results. All qualified applicants will receive consideration for employment without regard to race, national origin, age, sex, religion, disability, sexual orientation, marital status, veteran status, gender identity or expression, or any other basis protected by local, state, or federal law. This policy applies with regard to all aspects of one’s employment, including hiring, transfer, promotion, compensation, eligibility for benefits, and termination.</p>",
    "company": "New America",
    "company_url": "http://New America",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/d688caf0-70bc-11e8-930c-b4d742286fea"
  },
  {
    "id": "7dcb24e4-70b7-11e8-99b4-ca0d30057748",
    "created_at": "Fri Jun 15 16:16:42 UTC 2018",
    "title": " iOS/JavaScript Metrics Engineer - Apple Music",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.</p>\n\n<p>Do you love music and want to help shape the future of Apple Music services? Apple Music is looking for an extraordinary iOS / JavaScript engineer to help develop frameworks and tools to collect metrics from the iOS Music Application. This data will be used to generate insight into customer experiences drive key future endeavors.\n </p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Ability to write clear and high-performance code in Swift and JavaScript</li>\n<li>Ability to solve complex technical problems</li>\n<li>Ability to analyze large features and implement practical solutions</li>\n<li>Ability to step into a large code base and make surgical fixes</li>\n<li>Deep understanding of a variety of CS concepts and QA practices</li>\n<li>Passion for quality and close attention to details</li>\n<li>Strong communication and interpersonal skills</li>\n<li>Ability to deliver solid work on tight schedules</li>\n<li>Aptitude to independently learn new technologies.</li>\n</ul><p>Description:\nApple Music is looking for extraordinary software engineers to build the next generation of mobile applications. If you’re passionate about writing code, and want to work with world-class engineering teams that ship to millions of users, Apple Music is the place for you. As a UI Engineer focussing on metrics, you will be responsible for developing and implementing frameworks and tools for capturing user experience data in Apple Music. From this data we generate insights into how customers interact with our products, and use these insights to drive improvements to user-facing features. You are a highly skilled developer who strives to deliver great products. You know development standard methodologies, are comfortable working in large code bases, can create tools and frameworks, and can balance multiple projects. Strong attention to detail and a good sense of humor are also welcomed!</p>\n\n<p>Education:\nBachelor’s degree in computer science or related field, or equivalent work experience</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 113825640\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=b9b4795a0793953391cb736c539bb264\">https://ars2.equest.com/?response_id=b9b4795a0793953391cb736c539bb264</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/7b5709b2-70b7-11e8-8fb9-b53a9bbd2651.jpeg",
    "url": "http://jobs.github.com/positions/7dcb24e4-70b7-11e8-99b4-ca0d30057748"
  },
  {
    "id": "14bddd98-70b7-11e8-922c-83bafbdd8762",
    "created_at": "Fri Jun 15 16:14:47 UTC 2018",
    "title": "Technical Program Manager",
    "location": "Washington, DC",
    "type": "Full Time",
    "description": "<p>Genetic Alliance is a nonprofit health advocacy organization committed to engaging\nindividuals, families, and communities to transform health. We give people power to influence\nthe manner in which research is conducted and healthcare is delivered. To that end, we create\ntools and technologies that give communities and citizen scientists the ability to design and\nlead research. We believe strategic partnerships that put families in the driver seat in local,\nnational, and international settings are critical to meet our goals.</p>\n\n<p>One of our signature tools, the Platform for Engaging Everyone Responsibly (PEER), is a\nunique, award-winning technology platform that empowers people and families to aggregate\ntheir patient-reported outcomes and other health data and then make it available for health\nresearch. PEER maximizes engagement by enabling people to decide when and how their data\nis shared. Its custom survey interface has been used by more than 45 disease advocacy and\ncommunity-based organizations to redefine research to be of the people and for the people.</p>\n\n<p>General Position Overview:\nThe Technical Program Manager will oversee the platform's technical and product strategy and\nimplementation. This includes application and system architecture, development, production\nand testing, and implementing and maintaining overall engineering objectives, standards, and\ninitiatives.</p>\n\n<p>The Manager will lead both internal and outsourced engineering teams while also being able to\nnavigate and assess the code base when needed. The Manager will develop and oversee a\nrobust project management process and delivery timelines to keep projects on schedule and on\nbudget. This position will collaborate closely with the entire PEER team.</p>\n\n<p>Primary Responsibilities:\n● Manage PEER development, production and testing pipeline and infrastructure\n● Interface with external vendors to develop new modules and features\n● Administer project management systems, including JIRA, ServiceDesk and GitHub\n● Implement continuous integration tools (Travis) and testing scripts (Selenium, Sauce Labs)\n● Maintain and expand system documentation\n● Oversee transition of the codebase to open source\n● Conduct code review for both new and legacy code\n● Collaborate with key stakeholders to refine product roadmap\n● Review vendor proposals, estimates and deliverables\n● Ensure submitted code complies with approved requirements and specifications</p>\n\n<p>Qualifications:\n● Minimum of a bachelor’s degree in engineering or related field\n● 6+ years of professional engineering experience\n● 2+ years of management experience using agile methodologies and tools\n● 1+ years of experience managing remote development teams\n● Expert knowledge of web application design patterns\n● Strong knowledge of AWS, CI and deployment strategies such as Chef and CloudFormation\n● Strong knowledge of MySQL and ElasticSearch\n● Feel comfortable working daily with a codebase that is comprised of Java, PHP and JavaScript\n● Experience with the Angular and Laravel or similar frameworks\n● Comfort working with a codebase that is comprised of PHP, Java, and JavaScript preferred\n● Experience in a regulated industry with an understanding of HIPAA and 21 CFR 11 preferred\n● Familiarity with large, open-source projects preferred</p>",
    "how_to_apply": "<p>Interested applicants should send a resume, cover letter, and references to: Tetyana Murza,\n<a href=\"mailto:tmurza@geneticalliance.org\">tmurza@geneticalliance.org</a></p>",
    "company": "Genetic Alliance",
    "company_url": "http://Genetic Alliance",
    "company_logo": "http://github-jobs.s3.amazonaws.com/0c7f9090-70b7-11e8-8b97-090040e1a3dd.png",
    "url": "http://jobs.github.com/positions/14bddd98-70b7-11e8-922c-83bafbdd8762"
  },
  {
    "id": "e40010ec-57b4-11e8-8495-e72f6b8f41cb",
    "created_at": "Fri Jun 15 00:25:31 UTC 2018",
    "title": "Studio Game Engineer",
    "location": "Mountain View/Eugene/Tokyo",
    "type": "Full Time",
    "description": "<p>Game Closure is on the hunt for Game Engineers to help us build the social games that guide the development of our mobile game engine. We are a 60 ­strong and growing team with offices in Mountain View, California; Eugene, Oregon, and Tokyo, Japan. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n\n<p>The Role:</p>\n\n<ul>\n<li>Be responsible for designing, developing and deploying major game features</li>\n<li>Own game feature areas from end-­to­-end.</li>\n<li>Be the champion for the user! Insist on the highest standards and create functional and engaging features that will delight our users.</li>\n<li>Be part of a tight game development team looking to iterate fast on a fun concept and then building it out.</li>\n<li>Have real input on end-user product.</li>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Hands­ on architect and coder for sophisticated client/server systems for mobile gaming\nInnovate and iterate on process, systems, and technology to deliver world­-class social games\nBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!</li>\n</ul><p>Desired Skills:</p>\n\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience, working on cross-functional teams.</li>\n<li>Proven effectiveness in directing or delivering production software for high-quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).</li>\n<li>Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.</li>\n<li>We expect you to be good at using script debuggers like Chrome Debugger.</li>\n<li>You must be pretty knowledgeable with what jQuery can do, and what functionality you are better off custom coding.</li>\n<li>Strong Computer Science fundamentals in object­ oriented design, algorithms, and data structures.</li>\n<li>Advanced software engineering skills, including the ability to write maintainable and robust code in a popular object-oriented language.</li>\n<li>Solid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.</li>\n<li>Familiarity with git, svn or other VCS.</li>\n<li>Self ­starter, analytical and creative.</li>\n<li>Strong team player with a positive attitude.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.</li>\n<li>Check out Everwing on Facebook Instant Games in Messenger. Can you build this game?</li>\n</ul><p>Bonus:</p>\n\n<ul>\n<li>Canvas animation work.</li>\n<li>2+ years of game development experience with multiple shipped titles.</li>\n<li>Both Android and iOS game development experience.</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.).</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/b49b86c6-8d0c-4be5-8413-6af004aa9608?lever-origin=applied&amp;lever-source%5B%5D=github\">https://jobs.lever.co/gameclosure/b49b86c6-8d0c-4be5-8413-6af004aa9608?lever-origin=applied&amp;lever-source%5B%5D=github</a></p>",
    "company": "Game Closure",
    "company_url": "http://www.gameclosure.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e12c57c2-57b4-11e8-8535-0b22f4873fcc.png",
    "url": "http://jobs.github.com/positions/e40010ec-57b4-11e8-8495-e72f6b8f41cb"
  },
  {
    "id": "bd97a6e6-4e71-11e8-834f-97977b013641",
    "created_at": "Fri Jun 15 00:21:06 UTC 2018",
    "title": "System Software Engineer",
    "location": "Mountain View/ Eugene/Tokyo/Remote",
    "type": "Full Time",
    "description": "<p>Game Closure is on the hunt for System Software Engineers to help us build the social games that guide the development of our mobile game engine. We are a 60 ­strong and growing team with offices in Mountain View, California, Oregon and Tokyo. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n\n<p>As a System Software Engineer at Game Closure, you will play a pivotal role in creating a platform to revolutionize the mobile game development industry. Our engineers are generally amazing at something and great at everything else. We write cross-­compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js &amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n\n<p>The Role:</p>\n\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Play a critical role in day-­to-­day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Architect and code sophisticated client/server systems for mobile gaming.</li>\n<li>Learn from and mentor other engineers on your team.\n-Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company's long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n<li>Define the cutting edge of social gaming!</li>\n</ul><p>Desired Skills:</p>\n\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high­-quality code with a special focus on mobile performance.</li>\n<li>Solid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n</ul><p>Bonus:</p>\n\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Both Android and iOS game development experience</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github\">https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github</a></p>",
    "company": "Game Closure",
    "company_url": "http://www.gameclosure.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/af38bcc0-4e71-11e8-916f-e02499e1e14e.png",
    "url": "http://jobs.github.com/positions/bd97a6e6-4e71-11e8-834f-97977b013641"
  }]
