[
  {
    "id": "7a9ab966-5de2-11e8-9355-98e44f824bce",
    "created_at": "Tue May 22 17:07:11 UTC 2018",
    "title": "Senior Software Engineer, Ruby on Rails",
    "location": "Remote or Local",
    "type": "Full Time",
    "description": "<h3>Who is Litmus?</h3>\n\n<p>Major global brands across every industry and vertical trust Litmus to make email better, including 9 of the top 10 ecommerce brands, 7 of the top 10 technology companies, and 23 of the top 25 US ad agencies.</p>\n\n<p>Backed by $49M from Spectrum Equity, the Litmus email creation, testing, and analytics platform empowers marketers, designers, and agencies to confidently deliver customer experiences that ensure brand alignment and quality, as well as maximize performance and deliverability.</p>\n\n<h3>What would I do at Litmus?</h3>\n\n<p>It's simple. We have too many ideas. We want to try them all and add features to our existing products all while continuing to provide exceptional support to our growing customer base.</p>\n\n<p>We're looking for Ruby on Rails developers to help expand our product line, improve our existing products and help build the next generation of Litmus tools.</p>\n\n<p>A typical day for one of our developers might include working with our design team to figure out the best way to present a new feature to our customers, working with the .NET team to integrate a new API and working with customer support to squash bugs.</p>\n\n<h3>What is the hiring process like?</h3>\n\n<p>After receiving your application there a number of stages to our process:</p>\n\n<ol>\n<li>Initial interview. Learn more about Litmus and this role, and we learn a little more about you. This is via a video chat service like Zoom.us</li>\n<li>Sample project. A time-boxed exercise, around 4 hours, as an example of your best work given the scope and time constraints. The code, history &amp; resume are anonymised, then passed to the hiring team for review.</li>\n<li>Follow-up interview. Also via a video chat service, you'll meet with two members of our team engineering team to discuss the sample project work, decisions made along the way, and other technical topics.</li>\n<li>Final round. Spend a day onsite working on extensions to your sample project at one of our offices, meet some of our engineering leaders &amp; the rest of our Rails team!</li>\n</ol><h3>What are you looking for in a candidate?</h3>\n\n<p>You should have a strong understanding of Ruby and Ruby on Rails, we won't limit to x years experience, but you should be able to impress us with your app building skills. We are interested in people who have strong product experience, people who have spent a lot of time sweating the details about what really matters to customers. We're happy to introduce you to the plethora of other technologies we use.</p>\n\n<h3>Why should I choose Litmus?</h3>\n\n<p>We offer everything you'd expect from a financially successful and profitable startup, except we've been going strong for ten years. </p>\n\n<ul>\n<li>Great salary, comprehensive health care benefits, and a generous retirement plan match.\n28 days of paid vacation—that’s on top of team retreats, public holidays, and a holiday break in December.</li>\n<li>Remote friendly culture. Since many of our teammates are located around the globe, you'll also benefit from the first-class remote experience we've created—giving you the flexibility to work remotely when you need to, along with the tools and resources you need to succeed.</li>\n<li>Family friendly. Flexible schedules along with generous maternity and paternity policies.</li>\n<li>The best tools and technology money can buy. Top of the line hardware, software, and whatever else you need to be awesome. </li>\n</ul><p>It’s the company you keep. The people at Litmus are truly amazing, each in their own very individual way. What’s more, at Litmus we’re free to care more for our customers and our employees than most other companies can. Yet, we’re driven. With over 250,000 marketers trusting Litmus and outstanding profitable growth, you know you’re part of a winning team.</p>\n\n<hr><p>Unfortunately, we don't work with recruiters at this time.</p>",
    "how_to_apply": "<p>Apply online at <a href=\"http://jobs.litmus.com/apply/vdxV4fyZpR/Ruby-On-Rails-Developer?source=GitHub\">http://jobs.litmus.com/apply/vdxV4fyZpR/Ruby-On-Rails-Developer?source=GitHub</a></p>",
    "company": "Litmus Software, Inc.",
    "company_url": "https://litmus.com/careers",
    "company_logo": "http://github-jobs.s3.amazonaws.com/66948cc6-5de2-11e8-9a01-9149be11af56.png",
    "url": "http://jobs.github.com/positions/7a9ab966-5de2-11e8-9355-98e44f824bce"
  },
  {
    "id": "f723b3ae-5d3b-11e8-9b11-9fe6acd814ee",
    "created_at": "Mon May 21 21:18:16 UTC 2018",
    "title": "Front End Web Developer",
    "location": "Dallas, TX",
    "type": "Full Time",
    "description": "<p>Mizzen+Main is a highly differentiated, on-trend, digitally-native, branded apparel company that provides classic, American-made apparel constructed from innovative materials and targets active male consumers.  The company recently secured a large growth investment from a top consumer-focused private equity firm and is executing on an aggressive growth plan.</p>\n\n<p>The Front End Web Developer will support the Director of Ecommerce and is responsible for writing and maintaining code for the website as well as testing and optimizing the site in support of the attainment of company goals. This role presents a tremendous amount of growth potential for those dedicated to building the next great American brand. Reports to Director of Ecommerce in Dallas, Texas.</p>\n\n<p>Primary Responsibilities:</p>\n\n<ul>\n<li>Responsible for writing and maintaining well designed, testable, efficient code by using best software development practices</li>\n<li>Work closely with Ecommerce Director to resolve conflicts, prioritize needs, develop content criteria and provide solutions that support the attainment of company goals</li>\n<li>Perform ongoing maintenance, site updates and support project requests quickly and efficiently</li>\n<li>Identify and make recommendations on new technologies</li>\n<li>Manage relationship with outside development agencies when applicable</li>\n<li>Responsible for driving the business by identifying and pursuing new CRO and sales opportunities</li>\n<li>Troubleshoot any website issues or errors</li>\n<li>Develop and validate A/B and multi-variate test opportunities and scheduling</li>\n<li>Perform ongoing website updates, analyze CRO test performance and optimize the site based on continuous learnings</li>\n</ul><p>Requirements:</p>\n\n<ul>\n<li>Minimum of 3 years of Shopify software development experience</li>\n<li>Experience in Liquid, HTML5, jQuery, JavaScript and CSS3</li>\n<li>Experience with Ruby on Rails </li>\n<li>Must be detail oriented, highly reliable and efficient</li>\n<li>Problem solver with a proven ability to adapt to a rapidly changing environment</li>\n<li>Hard-working, dedicated and focused on achieving results</li>\n<li>Ability to work well independently and under pressure, as well as be highly responsive to partners </li>\n<li>Enthusiastic team player always willing to assist others and support the team</li>\n<li>Professional communicator with excellent verbal, written and interpersonal skills</li>\n<li>Full-time position on site at our corporate office located in Dallas, TX</li>\n</ul><p>To apply, please visit our <a href=\"https://jobs.lever.co/mizzenandmain/476b472a-30ac-4fac-818e-6c56187d25b1\">website</a></p>",
    "how_to_apply": "<p>To apply, please visit our <a href=\"https://jobs.lever.co/mizzenandmain/476b472a-30ac-4fac-818e-6c56187d25b1\">website</a></p>",
    "company": "Mizzen+Main",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/e195d59e-5d3b-11e8-975e-1a95bf97b1c6.JPG",
    "url": "http://jobs.github.com/positions/f723b3ae-5d3b-11e8-9b11-9fe6acd814ee"
  },
  {
    "id": "adc1ac34-5b79-11e8-82d6-1399d749ac6a",
    "created_at": "Sat May 19 15:32:37 UTC 2018",
    "title": "Sr. Rails & Front End Developer [React  / d3]",
    "location": "North America (remote)",
    "type": "Full Time",
    "description": "<p>Are you an Engineer looking to revolutionize the way people innovate and build software? Do you want to create something that will change the way people think about innovation, and work with cutting-edge visualization, collaboration, and social ideation technologies at the same time? We are looking for highly ambitious engineers who want to work on major aspects of the Aha! product — from the back-end through to the end user experience. If this is you, we want to hear from you!</p>\n\n<p>As a Senior Rails Engineer at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.</p>\n\n<h5>We are looking for someone who:</h5>\n\n<ul>\n<li>Is experienced in Ruby-on-Rails</li>\n<li>Has worked on key functionality for a cloud-based product</li>\n<li>Has a computer science degree or demonstrated experience solving challenging CS problems</li>\n<li>Wants to work on a major aspect of product functionality from back-end algorithms through to the user interface</li>\n<li>Wants to be great and work in a fast-moving, online environment where the end-user is key</li>\n</ul><h5>We are committed to being great, and we want someone who:</h5>\n\n<ul>\n<li>Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks</li>\n<li>Has a \"get it done\" attitude and a background of delivering superb work again and again</li>\n<li>Is seeking a career-defining opportunity and a proven, results-oriented team that has sold multiple software companies</li>\n</ul><p><em>We are building a distributed team, and you can work from anywhere in North America for this role. We offer generous salary, equity, benefits, and a profit-sharing program.</em></p>\n\n<p><strong>For immediate consideration, please follow these <a href=\"https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/\">helpful guidelines</a> and contact us at <a href=\"mailto:Engineering-jobs@aha.io\">Engineering-jobs@aha.io</a>. Be sure to include a link to your GitHub or code portfolio. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</strong></p>",
    "how_to_apply": "<p><strong>For immediate consideration, please follow these <a href=\"https://blog.aha.io/the-best-cover-letters-that-ceos-love-to-read/\">helpful guidelines</a> and contact us at <a href=\"mailto:Engineering-jobs@aha.io\">Engineering-jobs@aha.io</a>. Be sure to include a link to your GitHub or code portfolio. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.</strong></p>",
    "company": "Aha!",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/a41bd510-5b79-11e8-9152-9b032b2dd315.png",
    "url": "http://jobs.github.com/positions/adc1ac34-5b79-11e8-82d6-1399d749ac6a"
  },
  {
    "id": "13b71e28-289b-11e8-8082-82abb7667499",
    "created_at": "Thu May 17 21:37:32 UTC 2018",
    "title": "Software Engineer (multiple vacancies)",
    "location": "Seattle, WA & other cities",
    "type": "Full Time",
    "description": "<p>Several Vacancies in Seattle, London, Nuremberg, London, Paris, Alphen, Prague</p>\n\n<p>At SUSE we're building the next-generation container orchestration platform based on Kubernetes, and are looking for an Intermediate Engineer to join us as part of the SUSE Container Service Platform team.</p>\n\n<p>Specifically, we are working to develop infrastructure and a platform for services that run atop the Kubernetes Stack. We leverage open-source technologies like Kubernetes-Helm, Concourse, and SaltStack among others to achieve this goal. This is a great opportunity to build highly available, micro-service based distributed systems utilizing some of the latest cutting-edge container technologies.</p>\n\n<p>We're strongly committed to open source and contribute to numerous free and open projects and initiatives. We embrace and believe in the open source innovation model and the open source business model. As a member of the SUSE Container Service Platform team you will have the opportunity to contribute to Kubernetes, Helm, Moby and various other open source projects. You will work together with the communities for these projects and strive to continuously advance the state of the art to meet customer requirements.</p>\n\n<p>We're looking for someone who loves programming, enjoys working on complex problems, and is passionate about technology. You should have an analytical mind and experience with basic computer science concepts and best practices.</p>\n\n<p>On our team, you will have the opportunity to work with exciting new container technologies with a focus on using the right tools to get the job done most efficiently. Having a background in Golang, Python, or Ruby is helpful but not essential. You will have the opportunity to navigate and contribute to the full stack of services that we build on our SUSE Container Service Platform.</p>\n\n<p>Curiosity and good teamwork are two of the values that drive us as a development team. If you are passionate about these values too, you are likely a great fit for us. As a team, we're constantly finding ways to improve ourselves. We pride ourselves on our communication and teamwork -- we're all in this together!</p>\n\n<p>Requirements:</p>\n\n<p>Bachelor's degree in Computer Science (or equivalent)\nAbility to think in code, and write code in a high-level language\nAbility to grok complex problems, break them down into component parts, and come up with correct, elegant solutions to them</p>\n\n<p>Positives:</p>\n\n<p>Experience with Docker, Linux Containers, and/or Kubernetes\nExperience with open source development of any kind\nExperience with Cloud Computing (OpenStack, AWS, or Azure) and/or distributed systems\nAbout SUSE</p>\n\n<p>SUSE, a pioneer in open source software, provides reliable, software-defined infrastructure and application delivery solutions that give enterprises greater control and flexibility. More than 25 years of engineering excellence, exceptional service and an unrivaled partner ecosystem power the products and support that help our customers manage complexity, reduce cost, and confidently deliver mission-critical services. The lasting relationships we build allow us to adapt and deliver the smarter innovation they need to succeed today and tomorrow.</p>",
    "how_to_apply": "<p>Send CVs to <a href=\"mailto:sylwia.idec@suse.com\">sylwia.idec@suse.com</a></p>",
    "company": "SUSE",
    "company_url": "http://www.suse.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/0abea214-289b-11e8-9541-352c31833c65.png",
    "url": "http://jobs.github.com/positions/13b71e28-289b-11e8-8082-82abb7667499"
  },
  {
    "id": "a89d438c-70c6-11e8-9b37-9b2d31dd79c5",
    "created_at": "Fri Jun 15 18:05:39 UTC 2018",
    "title": "Lead Data Engineer",
    "location": "New York",
    "type": "Full Time",
    "description": "<p>About Us:</p>\n\n<p>CrowdTwist is seeking a Data Engineer for our growing team based in New York City. In this role, you will have full ownership of the CrowdTwist Data Pipeline to satisfy our ever growing data needs. You will be involved in many different projects as we continue to grow and enhance our platform.  You'll be working with large data sets across millions of users and will directly influence the loyalty program offerings for many of our clients, such as Pepsi, Marvel, Carhartt, Nestlé Purina, AMC’s The Walking Dead, TOMS, Steve Madden and Zumiez.</p>\n\n<p>We are a venture-backed NYC based company that provides the most comprehensive omni-channel loyalty &amp; analytics solutions for industry leading brands. We're relaxed, experienced, hard driving and are changing our industry.</p>\n\n<p>This role is for an engineer who loves to roll up their sleeves, dive in, and tackle any problem with speed and precision. You will work closely with the Data, Engineering and Product teams to implement, mature and optimize our Data Warehouse, Reporting and AI Data Models which drive actionable insights across the platform. You will be utilizing your experience with object-oriented software design and implementation, data modeling, and building high-performance, highly scalable data processing applications.  We operate in an agile manner, so you must thrive in a fast-paced environment and enjoy shipping product.</p>\n\n<p>In this role, you will work with a broad tech stack, including but not limited to:</p>\n\n<p>-Java</p>\n\n<p>-Python</p>\n\n<p>-Oracle</p>\n\n<p>-Redis</p>\n\n<p>-RabbitMQ</p>\n\n<p>-Docker</p>\n\n<p>-CloverETL</p>\n\n<p>-Amazon Web Services (Aurora, Redshift, DynamoDB, S3, Lambda, Kinesis, ElastiCache)</p>\n\n<p>This is what we're using today, but we're looking to take our data processing to the next level. We're looking for free thinkers that are open to new approaches and tech stacks.</p>\n\n<p>About You:</p>\n\n<p>-Have a BA/BS in Computer Science, Engineering, Information Systems or equivalent experience\nSelf-starter with 3+ years of experience as a Data Engineer dealing with large complex data scenarios</p>\n\n<p>-Proven ability to work with varied data infrastructures - including relational databases, column stores, NoSQL databases and file-based storage solutions</p>\n\n<p>-Experience with both compiled and scripting languages</p>\n\n<p>-Expert level SQL skills</p>\n\n<p>Excellent communication (verbal and written) and interpersonal skills and an ability to effectively communicate with both business and technical teams</p>\n\n<p>-Write great code, view it as a craft, and love cranking out solid work</p>\n\n<p>We have a fun, generous company culture that's built on our fundamental principle that when you give more, you get more:</p>\n\n<p>-Competitive compensation and generous employee benefits package including fully paid Medical, --Dental &amp; Vision plans for employees &amp; their dependents!</p>\n\n<p>-Stock options for all employees!</p>\n\n<p>-We bring toys to the office but still think the most fun thing to do is build product</p>\n\n<p>-Collaborative work environment that fosters bonds beyond the workplace</p>\n\n<p>-We treat our people well with employee recognition programs and referral bonuses</p>\n\n<p>-Better than average team building activities such as paintball, go cart racing, shuffleboard, organized sporting teams and off-site retreats. </p>\n\n<p>-Provide lunches, drinks and snacks so our team can be hungry for other things</p>\n\n<p>-Learn from and teach each other at CrowdTwist U</p>\n\n<p>-Pet friendly office environment</p>\n\n<p>If this sounds like you, get in touch. We're cool, relaxed, experienced, hard driving, changing our industry and looking for smart people like yourself to help tackle tough technical challenges.</p>\n\n<p>This is a full-time position based in our New York City office. Apply by sending us your resume and cover letter. Relocation assistance will be available if needed.</p>",
    "how_to_apply": "<p><a href=\"https://www.jsco.re/1-iui\">https://www.jsco.re/1-iui</a></p>",
    "company": "CrowdTwist",
    "company_url": "http://www.crowdtwist.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ce546cfe-70c6-11e8-99ae-708849f13ec5.png",
    "url": "http://jobs.github.com/positions/a89d438c-70c6-11e8-9b37-9b2d31dd79c5"
  },
  {
    "id": "bd97a6e6-4e71-11e8-834f-97977b013641",
    "created_at": "Fri Jun 15 00:21:06 UTC 2018",
    "title": "System Software Engineer",
    "location": "Mountain View/ Eugene/Tokyo/Remote",
    "type": "Full Time",
    "description": "<p>Game Closure is on the hunt for System Software Engineers to help us build the social games that guide the development of our mobile game engine. We are a 60 ­strong and growing team with offices in Mountain View, California, Oregon and Tokyo. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n\n<p>As a System Software Engineer at Game Closure, you will play a pivotal role in creating a platform to revolutionize the mobile game development industry. Our engineers are generally amazing at something and great at everything else. We write cross-­compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js &amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n\n<p>The Role:</p>\n\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Play a critical role in day-­to-­day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Architect and code sophisticated client/server systems for mobile gaming.</li>\n<li>Learn from and mentor other engineers on your team.\n-Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company's long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n<li>Define the cutting edge of social gaming!</li>\n</ul><p>Desired Skills:</p>\n\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high­-quality code with a special focus on mobile performance.</li>\n<li>Solid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n</ul><p>Bonus:</p>\n\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Both Android and iOS game development experience</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github\">https://jobs.lever.co/gameclosure/8de920f5-3220-4648-b5a7-7e8b2c382e51?lever-origin=applied&amp;lever-source%5B%5D=github</a></p>",
    "company": "Game Closure",
    "company_url": "http://www.gameclosure.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/af38bcc0-4e71-11e8-916f-e02499e1e14e.png",
    "url": "http://jobs.github.com/positions/bd97a6e6-4e71-11e8-834f-97977b013641"
  },
  {
    "id": "a29ee4e2-6fb6-11e8-89c1-418234aaa83f",
    "created_at": "Thu Jun 14 09:38:50 UTC 2018",
    "title": "Data Engineer",
    "location": "Berlin",
    "type": "Full Time",
    "description": "<p>Based in Berlin, Europe's creative tech capital, our employees from 40 nations work together to create high-quality casual games with engaging stories at the core of the experience.</p>\n\n<p>Working in independent teams, Wooga's signature approach to making great games for mobile has made us one of the world's most popular developers.</p>\n\n<p>We work hard to constantly improve and optimize our games to create even more amazing experiences to our players. To achieve that we use a combination of creativity and data.</p>\n\n<p>As a Data Engineer, you will be an essential part of our Data team. You will be working closely with various teams including data science, engineering, and game teams, to ensure that we collect and action the data in the best possible way. Some of your responsibilities include:</p>\n\n<ul>\n<li>You will be developing and improving our tracking infrastructure</li>\n<li>You will be building Big Data solutions</li>\n<li>You will be supporting our game teams to track the data that they need to evaluate new features and improve our games</li>\n<li>You will be working on the improvement of our in-house A/B-test solution</li>\n<li>You will be supporting our team of data scientists, by providing them an infrastructure helping them be as productive as possible</li>\n<li>You will ensure data consistency and quality. You understand how our data pipeline work. You will ensure and help the game teams to stay consistent with it.</li>\n<li>You will operate our data infrastructure, making sure it’s performant, reliable and runs smoothly.</li>\n</ul><p><strong>About you</strong></p>\n\n<ul>\n<li>Ideally, you have more than 3 years of experience in the Data Engineering field</li>\n<li>You enjoy building stable and scalable data pipelines, processing a mass amount of data every day</li>\n<li>You know that KAFKA is not just an author ;)</li>\n<li>You are familiar with cloud services like AWS and know the benefits of systems like Kubernetes or platforms like Airflow</li>\n<li>You love data. You enjoy digging into stuff, and working on a challenge until it is solved.</li>\n<li>You have a good understanding of basic analytics and machine learning concepts</li>\n<li>You have heard of, and ideally, have used one or more of the programming languages we use: Python, Scala, Java, Ruby, Ruby on Rails, Lua, or SQL</li>\n</ul><p><strong>Our Promise</strong></p>\n\n<ul>\n<li>Help to build the next-generation data pipeline, in a market that is spearheading the development in this area!</li>\n<li>Shape the future! Challenge the status quo and team up with a diverse group of experts working on crafting the world’s best games!</li>\n<li>Excite millions of players around the world every day through our games!</li>\n<li>We will connect you directly with the success of the company with the stock options programme.</li>\n<li>Work just minutes from the center of Europe’s most vibrant city, Socialize in our hang-out spaces, and enjoy many fun events and parties! Enjoy our unique office space!</li>\n<li>A relocation support which matches your needs to make your and your loved ones’ move to Berlin smooth! Did we mention that we also cooperate with Kindergartens?</li>\n<li>Make use of a significant education budget and extra days off for self-development. Join our meetups, talks, brown bag lunches, world cafe’s, internal trainings, workshops and many others!</li>\n<li>Did you know that German is the third most commonly taught language worldwide? Learn it too! We offer German language classes for you and your significant other!</li>\n<li>Choose your own equipment and be set up for success! We got your back!</li>\n<li>As much coffee, drinks, cereals and fruits as you can handle!</li>\n</ul><p><em>At Wooga we are committed to providing a friendly, safe and welcoming environment for everyone who works here or with us, regardless to gender, gender identity and expression, sexual orientation, disability, physical appearance, body size, race, age, religion (or lack thereof) and game preferences.</em></p>",
    "how_to_apply": "<p>Via this link: <a href=\"https://grnh.se/3beb50fb1\">https://grnh.se/3beb50fb1</a></p>",
    "company": "Wooga",
    "company_url": "http://Wooga",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9cf41602-6fb6-11e8-9ccb-4f93379b240d.jpg",
    "url": "http://jobs.github.com/positions/a29ee4e2-6fb6-11e8-89c1-418234aaa83f"
  },
  {
    "id": "0ffb5308-6f22-11e8-9676-16272eb100b5",
    "created_at": "Wed Jun 13 16:07:51 UTC 2018",
    "title": "Senior Back End Python Developer",
    "location": "London",
    "type": "Full Time",
    "description": "<p><a href=\"https://www.festicket.com/\">Festicket</a> empowers music fans with a seamless service to discover and book tickets and travel packages for music festivals worldwide. Our platform offers an end-to-end experience for music travellers, an efficient two-sided marketplace for 1,500+ music festivals across 40 different countries, and a network of 5,000 suppliers for accommodation &amp; travel packages. In five short years, we have become Europe's largest music festival platform. </p>\n\n<p>The Festicket Family is currently 120, and we're passionate about changing the face of live music experiences. Our <a href=\"https://www.google.co.uk/maps/@51.5402038,-0.1526522,3a,75y,333.58h,97.26t/data=!3m7!1e1!3m5!1sAF1QipMFkDyDNqyPkNZ_7tEF-vkwufnr3s7rrxZcehpJ!2e10!3e11!7i11096!8i5548\">head office</a> is in Camden, London with smaller offices in Berlin, Amsterdam and Porto.</p>\n\n<p>We're now post Series-C funded, and backed by some of the UK's largest VC funds.</p>\n\n<p>We've been announced as <a href=\"http://www.fasttrack.co.uk/company_profile/festicket/\">#6 in the Sunday Times Tech Track 100</a> &amp; a <a href=\"https://technation.io/news/future-fifty-2017/\">Tech City UK's Future Fifty company.</a> </p>\n\n<p>Join us on our mission in transforming the way music fans discover, book tickets and travel packages for festivals around the world. </p>\n\n<p><strong>THE ROLE</strong></p>\n\n<p>We are looking for a mid-level developer who specialises in Python and has a passion for building great products with solid engineering practices using the latest technologies.</p>\n\n<p>You would be working as a backend developer within one of our product focussed teams, working closely with other backend developers, frontend developers, QA engineers and the team’s product manager to deliver changes and new functionality. You would be involved in planning new work and helping the product manager decide what the team should be working on to achieve the team’s goals.</p>\n\n<p>You would also be working on technical tasks to improve our backend application architecture for performance, scalability and robustness while making use of the latest technologies, reducing complexity and making development easier.</p>\n\n<p><strong>YOUR ATTITUDE</strong></p>\n\n<p>You’re someone who’s smart, organised, motivated and gets things done. You want to work in a startup environment, because you like the idea of doing a bit of everything and taking ownership of what you work on. You have ideas about everything, and you’re not afraid to argue your point (while respecting everyone else’s of course). You’re constantly thinking “how can we do this better?”. You have the experience and aptitude to provide direction for other staff, to help develop your product sub-team and improve the team as a whole</p>\n\n<p>THE STACK</p>\n\n<p>Our backend application is built in Python 3 using the Django web framework, we use Django Rest Framework for our APIs and Celery for asynchronous tasks. We use Docker in development and production, all built from our CI service with AWS ECS as our orchestration system. We have tools to manage building and deploying staging environments via Slack and automate JIRA away so you almost don't notice it’s there.</p>\n\n<p><a href=\"http://stackshare.io/festicket/festicket\">http://stackshare.io/festicket/festicket</a></p>\n\n<p><strong>METHODOLOGY</strong></p>\n\n<p>We like to build fast, scalable, easily maintained and dynamic applications using the latest and greatest tools and technologies available. Most of all, we like to deliver! We believe in manageable chunks of work with continuous integration and delivery to enable multiple production releases per day, so that we’re always making progress.</p>\n\n<p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n<li>4+ years of working with Python, preferably in a web development context (beneficial to have some experience of Django or Flask framework)</li>\n<li>Knowledge of SQL</li>\n<li>Comfortable with git</li>\n<li>Have a computing or software engineering degree or applicable commercial engineering experience</li>\n<li>Experience integrating with 3rd party APIs would be beneficial</li>\n<li>It would be great if you’d had experience as a developer in the travel, music, e-commerce or ticketing industries before, but it’s not a requirement</li>\n</ul>",
    "how_to_apply": "<p>Please apply using the following link: <a href=\"https://festicket.workable.com/j/F9C82FC552\">https://festicket.workable.com/j/F9C82FC552</a></p>",
    "company": "Festicket",
    "company_url": "http://www.festicket.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/026c3310-6f22-11e8-9852-88f878de2092.png",
    "url": "http://jobs.github.com/positions/0ffb5308-6f22-11e8-9676-16272eb100b5"
  },
  {
    "id": "fcff86ba-6e41-11e8-9669-5d2cd9a17c3b",
    "created_at": "Tue Jun 12 13:11:01 UTC 2018",
    "title": "Java Developer",
    "location": "Amsterdam",
    "type": "Full Time",
    "description": "<p>Picnic is an app-only supermarket. We’re data driven with software at our core. Our world-class developers write immaculate code to support the world’s fastest growing supermarket. We’re on a quest for like-minded people to be part of the future of digital grocery shopping.</p>\n\n<p><strong>Where you fit in</strong>\nOur developers are integrated, involved, and essential to each part of our company. From route planning, scaling our customer analytics to handle millions of messages, to how many bananas we should have in our warehouse on a Thursday – they write, plan, and predict.</p>\n\n<p>As one of our Java Developers, you take ownership of projects, learn, and work collaboratively with your colleagues. You constantly design, test, evolve, and evaluate the nuts and bolts of our operation while offering a creative and analytical approach.</p>\n\n<p>The high-quality code that stems from your fingertips is stylish, sexy, and robust. You just love to build ultra-scalable systems. You’re at home writing platforms and you display an intricate understanding of how each line of code fits into a business plan.</p>\n\n<p>Your skills will be complemented with the latest tech. We are committed to pushing development wherever possible. When you arrive you’ll be working with Java 8, but soon you’ll help us make the transition to Java 9.</p>\n\n<p>At Picnic we have diverse projects to keep you interested. Think you should focus on Android development? That’s fine - you’ll have the freedom to experiment and evolve your own abilities.</p>\n\n<p>We don’t hide our developments. We open-source with the community that helped us grow. If you require more motivation to apply - check out our page:  <a href=\"http://picnic.tech\">http://picnic.tech</a></p>\n\n<p><strong>What you do</strong></p>\n\n<ul>\n<li>Design, develop, and test new user-facing features of our platform</li>\n<li>Create high-quality code that is scalable, reliable and reusable</li>\n<li>Innovate and advance the core planning, shopping, retailing and shipment algorithms</li>\n<li>Optimise supply chain systems to maximize operational performance and efficiency</li>\n<li>Analyse and improve the scalability and security of our platform</li>\n<li>Manage individual project priorities, deadlines and deliverables</li>\n</ul><p><strong>What you need</strong></p>\n\n<ul>\n<li>Bachelor’s Degree in Computer Science or related technical field</li>\n<li>1-3 years experience in Programming and Software Development</li>\n<li>Profound understanding of back-end development (Java, Spring MVC, MongoDB, Elastic, \nPostgreSQL)</li>\n<li>Critical thinking and initiative: Hands-on, nothing-is-impossible mindset</li>\n<li>Mental athleticism: Highly analytical and curious intellect</li>\n<li>Out-of-the-box thinking: Ability to translate business requirements into high-performing scalable \nsolutions</li>\n<li>Superb communication: Capacity to articulate technical problems and projects to all teams</li>\n</ul><p><strong>Technologies we use</strong></p>\n\n<ul>\n<li>Java 8 (RxJava and Spring), Python, JavaScript (TypeScript)</li>\n<li>ElasticSearch, RabbitMQ, Kinesis</li>\n<li>NPM, Yarn, Webpack</li>\n<li>Maven and Git</li>\n<li>PostgreSQL (PostGIS), MongoDB, Redshift (Spectrum), Athena</li>\n<li>Hadoop, Spark, Elastic MapReduce (EMR)</li>\n<li>AWS, Docker, Kubernetes, Kops, Terraform, Vault, Packer</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://grnh.se/d60c6f371\">https://grnh.se/d60c6f371</a></p>",
    "company": "Picnic",
    "company_url": "http://Picnic",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f877d49e-6e41-11e8-956f-be10489b108a.jpg",
    "url": "http://jobs.github.com/positions/fcff86ba-6e41-11e8-9669-5d2cd9a17c3b"
  }
]
